app/controllers/autocategorize_all_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1
SELECT 1 AS one FROM "categories" WHERE "categories"."user_id" = 1 LIMIT 1
SELECT "categories".* FROM "categories" INNER JOIN "note_categories" ON "categories"."id" = "note_categories"."category_id" WHERE "note_categories"."note_id" = 5
SELECT "notes".* FROM "notes" LEFT OUTER JOIN "note_categories" ON "note_categories"."note_id" = "notes"."id" WHERE "notes"."user_id" = 1 AND "note_categories"."id" IS NULL
SELECT 1 AS one FROM "notes" LEFT OUTER JOIN "note_categories" ON "note_categories"."note_id" = "notes"."id" WHERE "notes"."user_id" = 1 AND "note_categories"."id" IS NULL LIMIT 1
INSERT INTO "note_categories" ("note_id", "category_id", "created_at", "updated_at") VALUES (5, 3, '2026-05-07 09:02:32.659800', '2026-05-07 09:02:32.659800') RETURNING "id"
---
  def create
    categories = current_user.categories
    if categories.empty?
      return render json: { error: "No categories exist. Create a category first." }, status: :unprocessable_entity
    end

    uncategorized = current_user.notes
      .left_joins(:note_categories)
      .where(note_categories: { id: nil })

    if uncategorized.empty?
      return render json: { categorized: 0 }
    end

    category_list = categories.map { |c| "#{c.id}: #{c.title}" }.join("\n")
    notes_list = uncategorized.map { |n| "Note #{n.id}: [#{n.title}] #{n.content.to_s.truncate(200)}" }.join("\n\n")

    chat = RubyLLM.chat(model: "anthropic/claude-3-haiku")
    result = chat.ask(<<~PROMPT)

SELECT "categories".* FROM "categories" INNER JOIN "note_categories" ON "categories"."id" = "note_categories"."category_id" WHERE "note_categories"."note_id" = 5
---
      note = uncategorized.find { |n| n.id == note_id }
      next unless note && category_ids.include?(cat_id)

      note.categories = [ categories.find { |c| c.id == cat_id } ]