app/controllers/categories_controller.rb

  def index
    cats = current_user.categories.left_joins(:notes).group(:id).select(
      "categories.*, COUNT(note_categories.note_id) AS notes_count"
    ).order("categories.title ASC")

    uncategorized_count = current_user.notes
      .left_joins(:note_categories)
      .where(note_categories: { id: nil })
      .count

    result = cats.map { |c| category_json(c) }
---
SELECT COUNT(*) FROM "notes" LEFT OUTER JOIN "note_categories" ON "note_categories"."note_id" = "notes"."id" WHERE "notes"."user_id" = 1 AND "note_categories"."id" IS NULL
SELECT categories.*, COUNT(note_categories.note_id) AS notes_count FROM "categories" LEFT OUTER JOIN "note_categories" ON "note_categories"."category_id" = "categories"."id" LEFT OUTER JOIN "notes" ON "notes"."id" = "note_categories"."note_id" WHERE "categories"."user_id" = 1 GROUP BY "categories"."id"
SELECT "notes".* FROM "notes" INNER JOIN "note_categories" ON "notes"."id" = "note_categories"."note_id" WHERE "note_categories"."category_id" = 1

  def create
    category = current_user.categories.build(category_params)
    if category.save
---
INSERT INTO "categories" ("title", "user_id", "created_at", "updated_at") VALUES ('Work projects', 2, '2026-03-20 21:54:47.600636', '2026-03-20 21:54:47.600636') RETURNING "id"

  def set_category
    return if params[:id] == "0"
    @category = current_user.categories.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 2 AND "categories"."id" = 1 LIMIT 1