app/controllers/note_autocategorize_controller.rb

  def create
    categories = current_user.categories
    if categories.empty?
      return render json: { error: "No categories exist. Create a category first." }, status: :unprocessable_entity
    end

    category_list = categories.map { |c| "#{c.id}: #{c.title}" }.join("\n")

    chat = RubyLLM.chat(model: "anthropic/claude-3-haiku")
    result = chat.ask(<<~PROMPT)
      You are a note categorization assistant. Given a note and a list of categories, respond with ONLY the numeric ID of the single best-matching category. No explanation, no text, just the number.

      Categories:
      #{category_list}

      Note title: #{@note.title}

      Note content:
      #{@note.content}
    PROMPT

    chosen_id = result.content.strip.to_i
    category = categories.find { |c| c.id == chosen_id }
---
SELECT "categories".* FROM "categories" INNER JOIN "note_categories" ON "categories"."id" = "note_categories"."category_id" WHERE "note_categories"."note_id" = 3
SELECT 1 AS one FROM "categories" WHERE "categories"."user_id" = 1 LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1

  def set_note
    @note = current_user.notes.find(params[:note_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 AND "notes"."id" = 3 LIMIT 1