app/controllers/notes_controller.rb

  def index
    render json: current_user.notes.includes(:categories, :note_summary), include: [:categories, :note_summary]
---
SELECT "note_summaries".* FROM "note_summaries" WHERE "note_summaries"."note_id" IN (3, 4)
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 2
SELECT categories.*, COUNT(note_categories.note_id) AS notes_count FROM "categories" LEFT OUTER JOIN "note_categories" ON "note_categories"."category_id" = "categories"."id" LEFT OUTER JOIN "notes" ON "notes"."id" = "note_categories"."note_id" WHERE "categories"."user_id" = 1 GROUP BY "categories"."id"

  def create
    note = current_user.notes.build(note_params)
    if note.save
---
INSERT INTO "notes" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('Hello', 'How are you doing', 2, '2026-03-20 21:55:04.997178', '2026-03-20 21:55:04.997178') RETURNING "id"

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "content" = 'Project Lumyo – Feature Planning & Architecture Review

  def set_note
    @note = current_user.notes.includes(:categories, :note_summary).find(params[:id])
---
SELECT "note_categories".* FROM "note_categories" WHERE "note_categories"."note_id" = 3
SELECT "note_summaries".* FROM "note_summaries" WHERE "note_summaries"."note_id" = 3
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 AND "notes"."id" = 3 LIMIT 1

  def assign_categories(note, category_ids)
    return unless category_ids

    ids = Array(category_ids).map(&:to_i)
    categories = current_user.categories.where(id: ids)
---
SELECT "categories".* FROM "categories" INNER JOIN "note_categories" ON "categories"."id" = "note_categories"."category_id" WHERE "note_categories"."note_id" = 1