app/controllers/note_summaries_controller.rb

  def create
    summary = @note.note_summary || @note.build_note_summary
    summary.assign_attributes(status: "pending", content: nil, error_message: nil)
    summary.save!
---
INSERT INTO "note_summaries" ("note_id", "status", "content", "error_message", "created_at", "updated_at") VALUES (3, 'pending', NULL, NULL, '2026-05-07 08:47:26.491255', '2026-05-07 08:47:26.491255') RETURNING "id"

  def set_note
    @note = current_user.notes.find(params[:note_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 AND "notes"."id" = 3 LIMIT 1