app/jobs/generate_note_summary_job.rb

  def perform(note_summary_id)
    note_summary = NoteSummary.find(note_summary_id)
    note = note_summary.note

    note_summary.update!(status: "generating")
---
SELECT "note_summaries".* FROM "note_summaries" WHERE "note_summaries"."id" = 1 LIMIT 1
UPDATE "note_summaries" SET "status" = 'generating', "updated_at" = '2026-05-07 08:47:26.907494' WHERE "note_summaries"."id" = 1